tests/performance/websocket-load.yml
# Artillery WebSocket Load Test Configuration
# Tests COLOR-JELLY-RUSH game server under load

config:
  target: "ws://localhost:2567"
  phases:
    - name: "Warm up"
      duration: 60
      arrivalRate: 5
    - name: "Ramp up"
      duration: 120
      arrivalRate: 10
    - name: "Sustained load"
      duration: 300
      arrivalRate: 20
    - name: "Peak load"
      duration: 60
      arrivalRate: 50
  processor: "./load-test-processor.js"
  defaults:
    headers:
      content-type: "application/json"
  ensure:
    # Performance thresholds
    p99: 100
    maxErrorRate: 1

scenarios:
  - name: "Player game session"
    weight: 100
    engine: ws
    flow:
      # Join game with player data
      - function: "generatePlayerData"
      - think: 2
      
      # Send initial input
      - function: "generateMovementInput"
      - send:
          payload: |
            {
              "seq": {{ seq }},
              "targetX": {{ targetX }},
              "targetY": {{ targetY }},
              "space": {{ space }},
              "eject": {{ w }}
            }
      
      # Continue playing - send periodic inputs
      - loop:
          - function: "generateMovementInput"
          - send:
              payload: |
                {
                  "seq": {{ seq }},
                  "targetX": {{ targetX }},
                  "targetY": {{ targetY }},
                  "space": {{ space }},
                  "eject": {{ w }}
                }
          - think: 1
        count: 30
      
      # Disconnect
      - disconnect